program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3500.14.1"}, {"coremlc-version", "3500.32.1"}})]
{
    func main<ios16>(tensor<fp32, [1, 4160]> audio_input, tensor<fp32, [1, 128]> cell_state, tensor<fp32, [1, 128]> hidden_state) {
            tensor<int32, [2]> initial_context_begin_0 = const()[name = tensor<string, []>("initial_context_begin_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [2]> initial_context_end_0 = const()[name = tensor<string, []>("initial_context_end_0"), val = tensor<int32, [2]>([1, 64])];
            tensor<bool, [2]> initial_context_end_mask_0 = const()[name = tensor<string, []>("initial_context_end_mask_0"), val = tensor<bool, [2]>([true, false])];
            tensor<string, []> audio_input_to_fp16_dtype_0 = const()[name = tensor<string, []>("audio_input_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [1, 4160]> audio_input_to_fp16 = cast(dtype = audio_input_to_fp16_dtype_0, x = audio_input)[name = tensor<string, []>("cast_53")];
            tensor<fp16, [1, 64]> initial_context_cast_fp16 = slice_by_index(begin = initial_context_begin_0, end = initial_context_end_0, end_mask = initial_context_end_mask_0, x = audio_input_to_fp16)[name = tensor<string, []>("initial_context_cast_fp16")];
            tensor<int32, [2]> current_audio_begin_0 = const()[name = tensor<string, []>("current_audio_begin_0"), val = tensor<int32, [2]>([0, 64])];
            tensor<int32, [2]> current_audio_end_0 = const()[name = tensor<string, []>("current_audio_end_0"), val = tensor<int32, [2]>([1, 4160])];
            tensor<bool, [2]> current_audio_end_mask_0 = const()[name = tensor<string, []>("current_audio_end_mask_0"), val = tensor<bool, [2]>([true, true])];
            tensor<fp16, [1, 4096]> current_audio_cast_fp16 = slice_by_index(begin = current_audio_begin_0, end = current_audio_end_0, end_mask = current_audio_end_mask_0, x = audio_input_to_fp16)[name = tensor<string, []>("current_audio_cast_fp16")];
            tensor<int32, [2]> chunk_1_begin_0 = const()[name = tensor<string, []>("chunk_1_begin_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [2]> chunk_1_end_0 = const()[name = tensor<string, []>("chunk_1_end_0"), val = tensor<int32, [2]>([1, 512])];
            tensor<bool, [2]> chunk_1_end_mask_0 = const()[name = tensor<string, []>("chunk_1_end_mask_0"), val = tensor<bool, [2]>([true, false])];
            tensor<fp16, [1, 512]> chunk_1_cast_fp16 = slice_by_index(begin = chunk_1_begin_0, end = chunk_1_end_0, end_mask = chunk_1_end_mask_0, x = current_audio_cast_fp16)[name = tensor<string, []>("chunk_1_cast_fp16")];
            tensor<int32, []> var_38 = const()[name = tensor<string, []>("op_38"), val = tensor<int32, []>(1)];
            tensor<bool, []> x_1_interleave_0 = const()[name = tensor<string, []>("x_1_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 576]> x_1_cast_fp16 = concat(axis = var_38, interleave = x_1_interleave_0, values = (initial_context_cast_fp16, chunk_1_cast_fp16))[name = tensor<string, []>("x_1_cast_fp16")];
            tensor<int32, [2]> context_1_begin_0 = const()[name = tensor<string, []>("context_1_begin_0"), val = tensor<int32, [2]>([0, 448])];
            tensor<int32, [2]> context_1_end_0 = const()[name = tensor<string, []>("context_1_end_0"), val = tensor<int32, [2]>([1, 512])];
            tensor<bool, [2]> context_1_end_mask_0 = const()[name = tensor<string, []>("context_1_end_mask_0"), val = tensor<bool, [2]>([true, true])];
            tensor<fp16, [1, 64]> context_1_cast_fp16 = slice_by_index(begin = context_1_begin_0, end = context_1_end_0, end_mask = context_1_end_mask_0, x = chunk_1_cast_fp16)[name = tensor<string, []>("context_1_cast_fp16")];
            tensor<int32, [2]> chunk_3_begin_0 = const()[name = tensor<string, []>("chunk_3_begin_0"), val = tensor<int32, [2]>([0, 512])];
            tensor<int32, [2]> chunk_3_end_0 = const()[name = tensor<string, []>("chunk_3_end_0"), val = tensor<int32, [2]>([1, 1024])];
            tensor<bool, [2]> chunk_3_end_mask_0 = const()[name = tensor<string, []>("chunk_3_end_mask_0"), val = tensor<bool, [2]>([true, false])];
            tensor<fp16, [1, 512]> chunk_3_cast_fp16 = slice_by_index(begin = chunk_3_begin_0, end = chunk_3_end_0, end_mask = chunk_3_end_mask_0, x = current_audio_cast_fp16)[name = tensor<string, []>("chunk_3_cast_fp16")];
            tensor<int32, []> var_61 = const()[name = tensor<string, []>("op_61"), val = tensor<int32, []>(1)];
            tensor<bool, []> x_15_interleave_0 = const()[name = tensor<string, []>("x_15_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 576]> x_15_cast_fp16 = concat(axis = var_61, interleave = x_15_interleave_0, values = (context_1_cast_fp16, chunk_3_cast_fp16))[name = tensor<string, []>("x_15_cast_fp16")];
            tensor<int32, [2]> context_3_begin_0 = const()[name = tensor<string, []>("context_3_begin_0"), val = tensor<int32, [2]>([0, 448])];
            tensor<int32, [2]> context_3_end_0 = const()[name = tensor<string, []>("context_3_end_0"), val = tensor<int32, [2]>([1, 512])];
            tensor<bool, [2]> context_3_end_mask_0 = const()[name = tensor<string, []>("context_3_end_mask_0"), val = tensor<bool, [2]>([true, true])];
            tensor<fp16, [1, 64]> context_3_cast_fp16 = slice_by_index(begin = context_3_begin_0, end = context_3_end_0, end_mask = context_3_end_mask_0, x = chunk_3_cast_fp16)[name = tensor<string, []>("context_3_cast_fp16")];
            tensor<int32, [2]> chunk_5_begin_0 = const()[name = tensor<string, []>("chunk_5_begin_0"), val = tensor<int32, [2]>([0, 1024])];
            tensor<int32, [2]> chunk_5_end_0 = const()[name = tensor<string, []>("chunk_5_end_0"), val = tensor<int32, [2]>([1, 1536])];
            tensor<bool, [2]> chunk_5_end_mask_0 = const()[name = tensor<string, []>("chunk_5_end_mask_0"), val = tensor<bool, [2]>([true, false])];
            tensor<fp16, [1, 512]> chunk_5_cast_fp16 = slice_by_index(begin = chunk_5_begin_0, end = chunk_5_end_0, end_mask = chunk_5_end_mask_0, x = current_audio_cast_fp16)[name = tensor<string, []>("chunk_5_cast_fp16")];
            tensor<int32, []> var_84 = const()[name = tensor<string, []>("op_84"), val = tensor<int32, []>(1)];
            tensor<bool, []> x_29_interleave_0 = const()[name = tensor<string, []>("x_29_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 576]> x_29_cast_fp16 = concat(axis = var_84, interleave = x_29_interleave_0, values = (context_3_cast_fp16, chunk_5_cast_fp16))[name = tensor<string, []>("x_29_cast_fp16")];
            tensor<int32, [2]> context_5_begin_0 = const()[name = tensor<string, []>("context_5_begin_0"), val = tensor<int32, [2]>([0, 448])];
            tensor<int32, [2]> context_5_end_0 = const()[name = tensor<string, []>("context_5_end_0"), val = tensor<int32, [2]>([1, 512])];
            tensor<bool, [2]> context_5_end_mask_0 = const()[name = tensor<string, []>("context_5_end_mask_0"), val = tensor<bool, [2]>([true, true])];
            tensor<fp16, [1, 64]> context_5_cast_fp16 = slice_by_index(begin = context_5_begin_0, end = context_5_end_0, end_mask = context_5_end_mask_0, x = chunk_5_cast_fp16)[name = tensor<string, []>("context_5_cast_fp16")];
            tensor<int32, [2]> chunk_7_begin_0 = const()[name = tensor<string, []>("chunk_7_begin_0"), val = tensor<int32, [2]>([0, 1536])];
            tensor<int32, [2]> chunk_7_end_0 = const()[name = tensor<string, []>("chunk_7_end_0"), val = tensor<int32, [2]>([1, 2048])];
            tensor<bool, [2]> chunk_7_end_mask_0 = const()[name = tensor<string, []>("chunk_7_end_mask_0"), val = tensor<bool, [2]>([true, false])];
            tensor<fp16, [1, 512]> chunk_7_cast_fp16 = slice_by_index(begin = chunk_7_begin_0, end = chunk_7_end_0, end_mask = chunk_7_end_mask_0, x = current_audio_cast_fp16)[name = tensor<string, []>("chunk_7_cast_fp16")];
            tensor<int32, []> var_107 = const()[name = tensor<string, []>("op_107"), val = tensor<int32, []>(1)];
            tensor<bool, []> x_43_interleave_0 = const()[name = tensor<string, []>("x_43_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 576]> x_43_cast_fp16 = concat(axis = var_107, interleave = x_43_interleave_0, values = (context_5_cast_fp16, chunk_7_cast_fp16))[name = tensor<string, []>("x_43_cast_fp16")];
            tensor<int32, [2]> context_7_begin_0 = const()[name = tensor<string, []>("context_7_begin_0"), val = tensor<int32, [2]>([0, 448])];
            tensor<int32, [2]> context_7_end_0 = const()[name = tensor<string, []>("context_7_end_0"), val = tensor<int32, [2]>([1, 512])];
            tensor<bool, [2]> context_7_end_mask_0 = const()[name = tensor<string, []>("context_7_end_mask_0"), val = tensor<bool, [2]>([true, true])];
            tensor<fp16, [1, 64]> context_7_cast_fp16 = slice_by_index(begin = context_7_begin_0, end = context_7_end_0, end_mask = context_7_end_mask_0, x = chunk_7_cast_fp16)[name = tensor<string, []>("context_7_cast_fp16")];
            tensor<int32, [2]> chunk_9_begin_0 = const()[name = tensor<string, []>("chunk_9_begin_0"), val = tensor<int32, [2]>([0, 2048])];
            tensor<int32, [2]> chunk_9_end_0 = const()[name = tensor<string, []>("chunk_9_end_0"), val = tensor<int32, [2]>([1, 2560])];
            tensor<bool, [2]> chunk_9_end_mask_0 = const()[name = tensor<string, []>("chunk_9_end_mask_0"), val = tensor<bool, [2]>([true, false])];
            tensor<fp16, [1, 512]> chunk_9_cast_fp16 = slice_by_index(begin = chunk_9_begin_0, end = chunk_9_end_0, end_mask = chunk_9_end_mask_0, x = current_audio_cast_fp16)[name = tensor<string, []>("chunk_9_cast_fp16")];
            tensor<int32, []> var_130 = const()[name = tensor<string, []>("op_130"), val = tensor<int32, []>(1)];
            tensor<bool, []> x_57_interleave_0 = const()[name = tensor<string, []>("x_57_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 576]> x_57_cast_fp16 = concat(axis = var_130, interleave = x_57_interleave_0, values = (context_7_cast_fp16, chunk_9_cast_fp16))[name = tensor<string, []>("x_57_cast_fp16")];
            tensor<int32, [2]> context_9_begin_0 = const()[name = tensor<string, []>("context_9_begin_0"), val = tensor<int32, [2]>([0, 448])];
            tensor<int32, [2]> context_9_end_0 = const()[name = tensor<string, []>("context_9_end_0"), val = tensor<int32, [2]>([1, 512])];
            tensor<bool, [2]> context_9_end_mask_0 = const()[name = tensor<string, []>("context_9_end_mask_0"), val = tensor<bool, [2]>([true, true])];
            tensor<fp16, [1, 64]> context_9_cast_fp16 = slice_by_index(begin = context_9_begin_0, end = context_9_end_0, end_mask = context_9_end_mask_0, x = chunk_9_cast_fp16)[name = tensor<string, []>("context_9_cast_fp16")];
            tensor<int32, [2]> chunk_11_begin_0 = const()[name = tensor<string, []>("chunk_11_begin_0"), val = tensor<int32, [2]>([0, 2560])];
            tensor<int32, [2]> chunk_11_end_0 = const()[name = tensor<string, []>("chunk_11_end_0"), val = tensor<int32, [2]>([1, 3072])];
            tensor<bool, [2]> chunk_11_end_mask_0 = const()[name = tensor<string, []>("chunk_11_end_mask_0"), val = tensor<bool, [2]>([true, false])];
            tensor<fp16, [1, 512]> chunk_11_cast_fp16 = slice_by_index(begin = chunk_11_begin_0, end = chunk_11_end_0, end_mask = chunk_11_end_mask_0, x = current_audio_cast_fp16)[name = tensor<string, []>("chunk_11_cast_fp16")];
            tensor<int32, []> var_153 = const()[name = tensor<string, []>("op_153"), val = tensor<int32, []>(1)];
            tensor<bool, []> x_71_interleave_0 = const()[name = tensor<string, []>("x_71_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 576]> x_71_cast_fp16 = concat(axis = var_153, interleave = x_71_interleave_0, values = (context_9_cast_fp16, chunk_11_cast_fp16))[name = tensor<string, []>("x_71_cast_fp16")];
            tensor<int32, [2]> context_11_begin_0 = const()[name = tensor<string, []>("context_11_begin_0"), val = tensor<int32, [2]>([0, 448])];
            tensor<int32, [2]> context_11_end_0 = const()[name = tensor<string, []>("context_11_end_0"), val = tensor<int32, [2]>([1, 512])];
            tensor<bool, [2]> context_11_end_mask_0 = const()[name = tensor<string, []>("context_11_end_mask_0"), val = tensor<bool, [2]>([true, true])];
            tensor<fp16, [1, 64]> context_11_cast_fp16 = slice_by_index(begin = context_11_begin_0, end = context_11_end_0, end_mask = context_11_end_mask_0, x = chunk_11_cast_fp16)[name = tensor<string, []>("context_11_cast_fp16")];
            tensor<int32, [2]> chunk_13_begin_0 = const()[name = tensor<string, []>("chunk_13_begin_0"), val = tensor<int32, [2]>([0, 3072])];
            tensor<int32, [2]> chunk_13_end_0 = const()[name = tensor<string, []>("chunk_13_end_0"), val = tensor<int32, [2]>([1, 3584])];
            tensor<bool, [2]> chunk_13_end_mask_0 = const()[name = tensor<string, []>("chunk_13_end_mask_0"), val = tensor<bool, [2]>([true, false])];
            tensor<fp16, [1, 512]> chunk_13_cast_fp16 = slice_by_index(begin = chunk_13_begin_0, end = chunk_13_end_0, end_mask = chunk_13_end_mask_0, x = current_audio_cast_fp16)[name = tensor<string, []>("chunk_13_cast_fp16")];
            tensor<int32, []> var_176 = const()[name = tensor<string, []>("op_176"), val = tensor<int32, []>(1)];
            tensor<bool, []> x_85_interleave_0 = const()[name = tensor<string, []>("x_85_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 576]> x_85_cast_fp16 = concat(axis = var_176, interleave = x_85_interleave_0, values = (context_11_cast_fp16, chunk_13_cast_fp16))[name = tensor<string, []>("x_85_cast_fp16")];
            tensor<int32, [2]> context_begin_0 = const()[name = tensor<string, []>("context_begin_0"), val = tensor<int32, [2]>([0, 448])];
            tensor<int32, [2]> context_end_0 = const()[name = tensor<string, []>("context_end_0"), val = tensor<int32, [2]>([1, 512])];
            tensor<bool, [2]> context_end_mask_0 = const()[name = tensor<string, []>("context_end_mask_0"), val = tensor<bool, [2]>([true, true])];
            tensor<fp16, [1, 64]> context_cast_fp16 = slice_by_index(begin = context_begin_0, end = context_end_0, end_mask = context_end_mask_0, x = chunk_13_cast_fp16)[name = tensor<string, []>("context_cast_fp16")];
            tensor<int32, [2]> chunk_begin_0 = const()[name = tensor<string, []>("chunk_begin_0"), val = tensor<int32, [2]>([0, 3584])];
            tensor<int32, [2]> chunk_end_0 = const()[name = tensor<string, []>("chunk_end_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<bool, [2]> chunk_end_mask_0 = const()[name = tensor<string, []>("chunk_end_mask_0"), val = tensor<bool, [2]>([true, true])];
            tensor<fp16, [1, 512]> chunk_cast_fp16 = slice_by_index(begin = chunk_begin_0, end = chunk_end_0, end_mask = chunk_end_mask_0, x = current_audio_cast_fp16)[name = tensor<string, []>("chunk_cast_fp16")];
            tensor<int32, []> var_199 = const()[name = tensor<string, []>("op_199"), val = tensor<int32, []>(1)];
            tensor<bool, []> x_99_interleave_0 = const()[name = tensor<string, []>("x_99_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 576]> x_99_cast_fp16 = concat(axis = var_199, interleave = x_99_interleave_0, values = (context_cast_fp16, chunk_cast_fp16))[name = tensor<string, []>("x_99_cast_fp16")];
            tensor<int32, [1]> x_3_axes_0 = const()[name = tensor<string, []>("x_3_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 576]> x_3_cast_fp16 = expand_dims(axes = x_3_axes_0, x = x_1_cast_fp16)[name = tensor<string, []>("x_3_cast_fp16")];
            tensor<string, []> stft_out_1_pad_type_0 = const()[name = tensor<string, []>("stft_out_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> stft_out_1_pad_0 = const()[name = tensor<string, []>("stft_out_1_pad_0"), val = tensor<int32, [2]>([128, 128])];
            tensor<int32, [1]> stft_out_1_strides_0 = const()[name = tensor<string, []>("stft_out_1_strides_0"), val = tensor<int32, [1]>([256])];
            tensor<int32, [1]> stft_out_1_dilations_0 = const()[name = tensor<string, []>("stft_out_1_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> stft_out_1_groups_0 = const()[name = tensor<string, []>("stft_out_1_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [258, 1, 256]> stft_forward_basis_to_fp16_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("stft_forward_basis_to_fp16_quantized"), quantized_data = tensor<int8, [258, 1, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64))), scale = tensor<fp16, [258]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(66560))), zero_point = tensor<int8, [258]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(66176)))];
            tensor<fp16, [1, 258, 3]> stft_out_1_cast_fp16 = conv(dilations = stft_out_1_dilations_0, groups = stft_out_1_groups_0, pad = stft_out_1_pad_0, pad_type = stft_out_1_pad_type_0, strides = stft_out_1_strides_0, weight = stft_forward_basis_to_fp16_quantized, x = x_3_cast_fp16)[name = tensor<string, []>("stft_out_1_cast_fp16")];
            tensor<int32, [3]> var_219_begin_0 = const()[name = tensor<string, []>("op_219_begin_0"), val = tensor<int32, [3]>([0, 0, 0])];
            tensor<int32, [3]> var_219_end_0 = const()[name = tensor<string, []>("op_219_end_0"), val = tensor<int32, [3]>([1, 129, 3])];
            tensor<bool, [3]> var_219_end_mask_0 = const()[name = tensor<string, []>("op_219_end_mask_0"), val = tensor<bool, [3]>([true, false, true])];
            tensor<fp16, [1, 129, 3]> var_219_cast_fp16 = slice_by_index(begin = var_219_begin_0, end = var_219_end_0, end_mask = var_219_end_mask_0, x = stft_out_1_cast_fp16)[name = tensor<string, []>("op_219_cast_fp16")];
            tensor<int32, [3]> var_222_begin_0 = const()[name = tensor<string, []>("op_222_begin_0"), val = tensor<int32, [3]>([0, 129, 0])];
            tensor<int32, [3]> var_222_end_0 = const()[name = tensor<string, []>("op_222_end_0"), val = tensor<int32, [3]>([1, 258, 3])];
            tensor<bool, [3]> var_222_end_mask_0 = const()[name = tensor<string, []>("op_222_end_mask_0"), val = tensor<bool, [3]>([true, true, true])];
            tensor<fp16, [1, 129, 3]> var_222_cast_fp16 = slice_by_index(begin = var_222_begin_0, end = var_222_end_0, end_mask = var_222_end_mask_0, x = stft_out_1_cast_fp16)[name = tensor<string, []>("op_222_cast_fp16")];
            tensor<fp16, []> var_201_promoted_to_fp16 = const()[name = tensor<string, []>("op_201_promoted_to_fp16"), val = tensor<fp16, []>(0x1p+1)];
            tensor<fp16, [1, 129, 3]> var_224_cast_fp16 = pow(x = var_219_cast_fp16, y = var_201_promoted_to_fp16)[name = tensor<string, []>("op_224_cast_fp16")];
            tensor<fp16, []> var_201_promoted_1_to_fp16 = const()[name = tensor<string, []>("op_201_promoted_1_to_fp16"), val = tensor<fp16, []>(0x1p+1)];
            tensor<fp16, [1, 129, 3]> var_225_cast_fp16 = pow(x = var_222_cast_fp16, y = var_201_promoted_1_to_fp16)[name = tensor<string, []>("op_225_cast_fp16")];
            tensor<fp16, [1, 129, 3]> var_226_cast_fp16 = add(x = var_224_cast_fp16, y = var_225_cast_fp16)[name = tensor<string, []>("op_226_cast_fp16")];
            tensor<fp16, []> var_227_to_fp16 = const()[name = tensor<string, []>("op_227_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [1, 129, 3]> var_228_cast_fp16 = add(x = var_226_cast_fp16, y = var_227_to_fp16)[name = tensor<string, []>("op_228_cast_fp16")];
            tensor<fp16, [1, 129, 3]> magnitude_1_cast_fp16 = sqrt(x = var_228_cast_fp16)[name = tensor<string, []>("magnitude_1_cast_fp16")];
            tensor<fp16, []> var_230_to_fp16 = const()[name = tensor<string, []>("op_230_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [1, 129, 3]> var_231_cast_fp16 = add(x = magnitude_1_cast_fp16, y = var_230_to_fp16)[name = tensor<string, []>("op_231_cast_fp16")];
            tensor<fp16, []> input_1_epsilon_0_to_fp16 = const()[name = tensor<string, []>("input_1_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 129, 3]> input_1_cast_fp16 = log(epsilon = input_1_epsilon_0_to_fp16, x = var_231_cast_fp16)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<string, []> input_3_pad_type_0 = const()[name = tensor<string, []>("input_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_3_pad_0 = const()[name = tensor<string, []>("input_3_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> input_3_strides_0 = const()[name = tensor<string, []>("input_3_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> input_3_dilations_0 = const()[name = tensor<string, []>("input_3_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_3_groups_0 = const()[name = tensor<string, []>("input_3_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 129, 3]> encoder_layers_0_weight_to_fp16_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("encoder_layers_0_weight_to_fp16_quantized"), quantized_data = tensor<int8, [128, 129, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(67200))), scale = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(116992))), zero_point = tensor<int8, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(116800)))];
            tensor<fp16, [128]> encoder_layers_0_bias_to_fp16 = const()[name = tensor<string, []>("encoder_layers_0_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(117312)))];
            tensor<fp16, [1, 128, 3]> input_3_cast_fp16 = conv(bias = encoder_layers_0_bias_to_fp16, dilations = input_3_dilations_0, groups = input_3_groups_0, pad = input_3_pad_0, pad_type = input_3_pad_type_0, strides = input_3_strides_0, weight = encoder_layers_0_weight_to_fp16_quantized, x = input_1_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<fp16, [1, 128, 3]> x_5_cast_fp16 = relu(x = input_3_cast_fp16)[name = tensor<string, []>("x_5_cast_fp16")];
            tensor<fp16, []> const_0_to_fp16 = const()[name = tensor<string, []>("const_0_to_fp16"), val = tensor<fp16, []>(-inf)];
            tensor<fp16, []> var_233_to_fp16 = const()[name = tensor<string, []>("op_233_to_fp16"), val = tensor<fp16, []>(0x1.388p+13)];
            tensor<fp16, [1, 128, 3]> clip_0_cast_fp16 = clip(alpha = const_0_to_fp16, beta = var_233_to_fp16, x = x_5_cast_fp16)[name = tensor<string, []>("clip_0_cast_fp16")];
            tensor<string, []> input_7_pad_type_0 = const()[name = tensor<string, []>("input_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_7_pad_0 = const()[name = tensor<string, []>("input_7_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> input_7_strides_0 = const()[name = tensor<string, []>("input_7_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> input_7_dilations_0 = const()[name = tensor<string, []>("input_7_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_7_groups_0 = const()[name = tensor<string, []>("input_7_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 128, 3]> encoder_layers_2_weight_to_fp16_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("encoder_layers_2_weight_to_fp16_quantized"), quantized_data = tensor<int8, [64, 128, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(117632))), scale = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(142400))), zero_point = tensor<int8, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(142272)))];
            tensor<fp16, [64]> encoder_layers_2_bias_to_fp16 = const()[name = tensor<string, []>("encoder_layers_2_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(142592)))];
            tensor<fp16, [1, 64, 3]> input_7_cast_fp16 = conv(bias = encoder_layers_2_bias_to_fp16, dilations = input_7_dilations_0, groups = input_7_groups_0, pad = input_7_pad_0, pad_type = input_7_pad_type_0, strides = input_7_strides_0, weight = encoder_layers_2_weight_to_fp16_quantized, x = clip_0_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<fp16, [1, 64, 3]> x_7_cast_fp16 = relu(x = input_7_cast_fp16)[name = tensor<string, []>("x_7_cast_fp16")];
            tensor<fp16, []> const_1_to_fp16 = const()[name = tensor<string, []>("const_1_to_fp16"), val = tensor<fp16, []>(-inf)];
            tensor<fp16, [1, 64, 3]> clip_1_cast_fp16 = clip(alpha = const_1_to_fp16, beta = var_233_to_fp16, x = x_7_cast_fp16)[name = tensor<string, []>("clip_1_cast_fp16")];
            tensor<string, []> input_11_pad_type_0 = const()[name = tensor<string, []>("input_11_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_11_pad_0 = const()[name = tensor<string, []>("input_11_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> input_11_strides_0 = const()[name = tensor<string, []>("input_11_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> input_11_dilations_0 = const()[name = tensor<string, []>("input_11_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_11_groups_0 = const()[name = tensor<string, []>("input_11_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 64, 3]> encoder_layers_4_weight_to_fp16_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("encoder_layers_4_weight_to_fp16_quantized"), quantized_data = tensor<int8, [64, 64, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(142784))), scale = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(155264))), zero_point = tensor<int8, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(155136)))];
            tensor<fp16, [64]> encoder_layers_4_bias_to_fp16 = const()[name = tensor<string, []>("encoder_layers_4_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(155456)))];
            tensor<fp16, [1, 64, 3]> input_11_cast_fp16 = conv(bias = encoder_layers_4_bias_to_fp16, dilations = input_11_dilations_0, groups = input_11_groups_0, pad = input_11_pad_0, pad_type = input_11_pad_type_0, strides = input_11_strides_0, weight = encoder_layers_4_weight_to_fp16_quantized, x = clip_1_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<fp16, [1, 64, 3]> x_9_cast_fp16 = relu(x = input_11_cast_fp16)[name = tensor<string, []>("x_9_cast_fp16")];
            tensor<fp16, []> const_2_to_fp16 = const()[name = tensor<string, []>("const_2_to_fp16"), val = tensor<fp16, []>(-inf)];
            tensor<fp16, [1, 64, 3]> clip_2_cast_fp16 = clip(alpha = const_2_to_fp16, beta = var_233_to_fp16, x = x_9_cast_fp16)[name = tensor<string, []>("clip_2_cast_fp16")];
            tensor<string, []> input_15_pad_type_0 = const()[name = tensor<string, []>("input_15_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_15_pad_0 = const()[name = tensor<string, []>("input_15_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> input_15_strides_0 = const()[name = tensor<string, []>("input_15_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> input_15_dilations_0 = const()[name = tensor<string, []>("input_15_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_15_groups_0 = const()[name = tensor<string, []>("input_15_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 64, 3]> encoder_layers_6_weight_to_fp16_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("encoder_layers_6_weight_to_fp16_quantized"), quantized_data = tensor<int8, [128, 64, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(155648))), scale = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(180288))), zero_point = tensor<int8, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(116800)))];
            tensor<fp16, [128]> encoder_layers_6_bias_to_fp16 = const()[name = tensor<string, []>("encoder_layers_6_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(180608)))];
            tensor<fp16, [1, 128, 3]> input_15_cast_fp16 = conv(bias = encoder_layers_6_bias_to_fp16, dilations = input_15_dilations_0, groups = input_15_groups_0, pad = input_15_pad_0, pad_type = input_15_pad_type_0, strides = input_15_strides_0, weight = encoder_layers_6_weight_to_fp16_quantized, x = clip_2_cast_fp16)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<fp16, [1, 128, 3]> x_11_cast_fp16 = relu(x = input_15_cast_fp16)[name = tensor<string, []>("x_11_cast_fp16")];
            tensor<fp16, []> const_3_to_fp16 = const()[name = tensor<string, []>("const_3_to_fp16"), val = tensor<fp16, []>(-inf)];
            tensor<fp16, [1, 128, 3]> clip_3_cast_fp16 = clip(alpha = const_3_to_fp16, beta = var_233_to_fp16, x = x_11_cast_fp16)[name = tensor<string, []>("clip_3_cast_fp16")];
            tensor<int32, [3]> transpose_0_perm_0 = const()[name = tensor<string, []>("transpose_0_perm_0"), val = tensor<int32, [3]>([2, 0, 1])];
            tensor<string, []> transpose_0_cast_fp16_to_fp32_dtype_0 = const()[name = tensor<string, []>("transpose_0_cast_fp16_to_fp32_dtype_0"), val = tensor<string, []>("fp32")];
            tensor<int32, [1]> hx_1_axes_0 = const()[name = tensor<string, []>("hx_1_axes_0"), val = tensor<int32, [1]>([0])];
            tensor<string, []> hidden_state_to_fp16_dtype_0 = const()[name = tensor<string, []>("hidden_state_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [1, 128]> hidden_state_to_fp16 = cast(dtype = hidden_state_to_fp16_dtype_0, x = hidden_state)[name = tensor<string, []>("cast_52")];
            tensor<fp16, [1, 1, 128]> hx_1_cast_fp16 = expand_dims(axes = hx_1_axes_0, x = hidden_state_to_fp16)[name = tensor<string, []>("hx_1_cast_fp16")];
            tensor<int32, [1]> hx_3_axes_0 = const()[name = tensor<string, []>("hx_3_axes_0"), val = tensor<int32, [1]>([0])];
            tensor<string, []> cell_state_to_fp16_dtype_0 = const()[name = tensor<string, []>("cell_state_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [1, 128]> cell_state_to_fp16 = cast(dtype = cell_state_to_fp16_dtype_0, x = cell_state)[name = tensor<string, []>("cast_51")];
            tensor<fp16, [1, 1, 128]> hx_3_cast_fp16 = expand_dims(axes = hx_3_axes_0, x = cell_state_to_fp16)[name = tensor<string, []>("hx_3_cast_fp16")];
            tensor<fp32, [512]> concat_0 = const()[name = tensor<string, []>("concat_0"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(180928)))];
            tensor<fp32, [512, 128]> concat_1_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("concat_1_quantized"), quantized_data = tensor<int8, [512, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(183040))), scale = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(249216))), zero_point = tensor<int8, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(248640)))];
            tensor<fp32, [512, 128]> concat_2_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("concat_2_quantized"), quantized_data = tensor<int8, [512, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(251328))), scale = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(316928))), zero_point = tensor<int8, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(248640)))];
            tensor<int32, [1]> lstm_out_1_batch_first_lstm_h0_squeeze_axes_0 = const()[name = tensor<string, []>("lstm_out_1_batch_first_lstm_h0_squeeze_axes_0"), val = tensor<int32, [1]>([0])];
            tensor<fp16, [1, 128]> lstm_out_1_batch_first_lstm_h0_squeeze_cast_fp16 = squeeze(axes = lstm_out_1_batch_first_lstm_h0_squeeze_axes_0, x = hx_1_cast_fp16)[name = tensor<string, []>("lstm_out_1_batch_first_lstm_h0_squeeze_cast_fp16")];
            tensor<string, []> lstm_out_1_batch_first_lstm_h0_squeeze_cast_fp16_to_fp32_dtype_0 = const()[name = tensor<string, []>("lstm_out_1_batch_first_lstm_h0_squeeze_cast_fp16_to_fp32_dtype_0"), val = tensor<string, []>("fp32")];
            tensor<int32, [1]> lstm_out_1_batch_first_lstm_c0_squeeze_axes_0 = const()[name = tensor<string, []>("lstm_out_1_batch_first_lstm_c0_squeeze_axes_0"), val = tensor<int32, [1]>([0])];
            tensor<fp16, [1, 128]> lstm_out_1_batch_first_lstm_c0_squeeze_cast_fp16 = squeeze(axes = lstm_out_1_batch_first_lstm_c0_squeeze_axes_0, x = hx_3_cast_fp16)[name = tensor<string, []>("lstm_out_1_batch_first_lstm_c0_squeeze_cast_fp16")];
            tensor<string, []> lstm_out_1_batch_first_lstm_c0_squeeze_cast_fp16_to_fp32_dtype_0 = const()[name = tensor<string, []>("lstm_out_1_batch_first_lstm_c0_squeeze_cast_fp16_to_fp32_dtype_0"), val = tensor<string, []>("fp32")];
            tensor<string, []> lstm_out_1_batch_first_direction_0 = const()[name = tensor<string, []>("lstm_out_1_batch_first_direction_0"), val = tensor<string, []>("forward")];
            tensor<bool, []> lstm_out_1_batch_first_output_sequence_0 = const()[name = tensor<string, []>("lstm_out_1_batch_first_output_sequence_0"), val = tensor<bool, []>(true)];
            tensor<string, []> lstm_out_1_batch_first_recurrent_activation_0 = const()[name = tensor<string, []>("lstm_out_1_batch_first_recurrent_activation_0"), val = tensor<string, []>("sigmoid")];
            tensor<string, []> lstm_out_1_batch_first_cell_activation_0 = const()[name = tensor<string, []>("lstm_out_1_batch_first_cell_activation_0"), val = tensor<string, []>("tanh")];
            tensor<string, []> lstm_out_1_batch_first_activation_0 = const()[name = tensor<string, []>("lstm_out_1_batch_first_activation_0"), val = tensor<string, []>("tanh")];
            tensor<fp16, [3, 1, 128]> transpose_0_cast_fp16 = transpose(perm = transpose_0_perm_0, x = clip_3_cast_fp16)[name = tensor<string, []>("transpose_15")];
            tensor<fp32, [3, 1, 128]> transpose_0_cast_fp16_to_fp32 = cast(dtype = transpose_0_cast_fp16_to_fp32_dtype_0, x = transpose_0_cast_fp16)[name = tensor<string, []>("cast_48")];
            tensor<fp32, [1, 128]> lstm_out_1_batch_first_lstm_h0_squeeze_cast_fp16_to_fp32 = cast(dtype = lstm_out_1_batch_first_lstm_h0_squeeze_cast_fp16_to_fp32_dtype_0, x = lstm_out_1_batch_first_lstm_h0_squeeze_cast_fp16)[name = tensor<string, []>("cast_49")];
            tensor<fp32, [1, 128]> lstm_out_1_batch_first_lstm_c0_squeeze_cast_fp16_to_fp32 = cast(dtype = lstm_out_1_batch_first_lstm_c0_squeeze_cast_fp16_to_fp32_dtype_0, x = lstm_out_1_batch_first_lstm_c0_squeeze_cast_fp16)[name = tensor<string, []>("cast_50")];
            tensor<fp32, [3, 1, 128]> lstm_out_1_batch_first_0, tensor<fp32, [1, 128]> lstm_out_1_batch_first_1, tensor<fp32, [1, 128]> lstm_out_1_batch_first_2 = lstm(activation = lstm_out_1_batch_first_activation_0, bias = concat_0, cell_activation = lstm_out_1_batch_first_cell_activation_0, direction = lstm_out_1_batch_first_direction_0, initial_c = lstm_out_1_batch_first_lstm_c0_squeeze_cast_fp16_to_fp32, initial_h = lstm_out_1_batch_first_lstm_h0_squeeze_cast_fp16_to_fp32, output_sequence = lstm_out_1_batch_first_output_sequence_0, recurrent_activation = lstm_out_1_batch_first_recurrent_activation_0, weight_hh = concat_2_quantized, weight_ih = concat_1_quantized, x = transpose_0_cast_fp16_to_fp32)[name = tensor<string, []>("lstm_out_1_batch_first")];
            tensor<int32, [3]> transpose_1_perm_0 = const()[name = tensor<string, []>("transpose_1_perm_0"), val = tensor<int32, [3]>([1, 2, 0])];
            tensor<string, []> lstm_out_1_batch_first_0_to_fp16_dtype_0 = const()[name = tensor<string, []>("lstm_out_1_batch_first_0_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<int32, [1]> hn_1_axes_0 = const()[name = tensor<string, []>("hn_1_axes_0"), val = tensor<int32, [1]>([0])];
            tensor<string, []> lstm_out_1_batch_first_1_to_fp16_dtype_0 = const()[name = tensor<string, []>("lstm_out_1_batch_first_1_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [1, 128]> lstm_out_1_batch_first_1_to_fp16 = cast(dtype = lstm_out_1_batch_first_1_to_fp16_dtype_0, x = lstm_out_1_batch_first_1)[name = tensor<string, []>("cast_47")];
            tensor<fp16, [1, 1, 128]> hn_1_cast_fp16 = expand_dims(axes = hn_1_axes_0, x = lstm_out_1_batch_first_1_to_fp16)[name = tensor<string, []>("hn_1_cast_fp16")];
            tensor<int32, [1]> cn_1_axes_0 = const()[name = tensor<string, []>("cn_1_axes_0"), val = tensor<int32, [1]>([0])];
            tensor<string, []> lstm_out_1_batch_first_2_to_fp16_dtype_0 = const()[name = tensor<string, []>("lstm_out_1_batch_first_2_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [1, 128]> lstm_out_1_batch_first_2_to_fp16 = cast(dtype = lstm_out_1_batch_first_2_to_fp16_dtype_0, x = lstm_out_1_batch_first_2)[name = tensor<string, []>("cast_46")];
            tensor<fp16, [1, 1, 128]> cn_1_cast_fp16 = expand_dims(axes = cn_1_axes_0, x = lstm_out_1_batch_first_2_to_fp16)[name = tensor<string, []>("cn_1_cast_fp16")];
            tensor<string, []> input_21_pad_type_0 = const()[name = tensor<string, []>("input_21_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [1]> input_21_strides_0 = const()[name = tensor<string, []>("input_21_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [2]> input_21_pad_0 = const()[name = tensor<string, []>("input_21_pad_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [1]> input_21_dilations_0 = const()[name = tensor<string, []>("input_21_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_21_groups_0 = const()[name = tensor<string, []>("input_21_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 128, 1]> decoder_final_conv_weight_to_fp16 = const()[name = tensor<string, []>("decoder_final_conv_weight_to_fp16"), val = tensor<fp16, [1, 128, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(319040)))];
            tensor<fp16, [1]> decoder_final_conv_bias_to_fp16 = const()[name = tensor<string, []>("decoder_final_conv_bias_to_fp16"), val = tensor<fp16, [1]>([0x1.dfp-5])];
            tensor<fp16, [3, 1, 128]> lstm_out_1_batch_first_0_to_fp16 = cast(dtype = lstm_out_1_batch_first_0_to_fp16_dtype_0, x = lstm_out_1_batch_first_0)[name = tensor<string, []>("cast_45")];
            tensor<fp16, [1, 128, 3]> transpose_1_cast_fp16 = transpose(perm = transpose_1_perm_0, x = lstm_out_1_batch_first_0_to_fp16)[name = tensor<string, []>("transpose_14")];
            tensor<fp16, [1, 1, 3]> input_21_cast_fp16 = conv(bias = decoder_final_conv_bias_to_fp16, dilations = input_21_dilations_0, groups = input_21_groups_0, pad = input_21_pad_0, pad_type = input_21_pad_type_0, strides = input_21_strides_0, weight = decoder_final_conv_weight_to_fp16, x = transpose_1_cast_fp16)[name = tensor<string, []>("input_21_cast_fp16")];
            tensor<fp16, [1, 1, 3]> out_1_cast_fp16 = sigmoid(x = input_21_cast_fp16)[name = tensor<string, []>("out_1_cast_fp16")];
            tensor<int32, [1]> var_318_axes_0 = const()[name = tensor<string, []>("op_318_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<bool, []> var_318_keep_dims_0 = const()[name = tensor<string, []>("op_318_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 1, 1]> var_318_cast_fp16 = reduce_mean(axes = var_318_axes_0, keep_dims = var_318_keep_dims_0, x = out_1_cast_fp16)[name = tensor<string, []>("op_318_cast_fp16")];
            tensor<int32, [1]> x_17_axes_0 = const()[name = tensor<string, []>("x_17_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 576]> x_17_cast_fp16 = expand_dims(axes = x_17_axes_0, x = x_15_cast_fp16)[name = tensor<string, []>("x_17_cast_fp16")];
            tensor<string, []> stft_out_3_pad_type_0 = const()[name = tensor<string, []>("stft_out_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> stft_out_3_pad_0 = const()[name = tensor<string, []>("stft_out_3_pad_0"), val = tensor<int32, [2]>([128, 128])];
            tensor<int32, [1]> stft_out_3_strides_0 = const()[name = tensor<string, []>("stft_out_3_strides_0"), val = tensor<int32, [1]>([256])];
            tensor<int32, [1]> stft_out_3_dilations_0 = const()[name = tensor<string, []>("stft_out_3_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> stft_out_3_groups_0 = const()[name = tensor<string, []>("stft_out_3_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 258, 3]> stft_out_3_cast_fp16 = conv(dilations = stft_out_3_dilations_0, groups = stft_out_3_groups_0, pad = stft_out_3_pad_0, pad_type = stft_out_3_pad_type_0, strides = stft_out_3_strides_0, weight = stft_forward_basis_to_fp16_quantized, x = x_17_cast_fp16)[name = tensor<string, []>("stft_out_3_cast_fp16")];
            tensor<int32, [3]> var_343_begin_0 = const()[name = tensor<string, []>("op_343_begin_0"), val = tensor<int32, [3]>([0, 0, 0])];
            tensor<int32, [3]> var_343_end_0 = const()[name = tensor<string, []>("op_343_end_0"), val = tensor<int32, [3]>([1, 129, 3])];
            tensor<bool, [3]> var_343_end_mask_0 = const()[name = tensor<string, []>("op_343_end_mask_0"), val = tensor<bool, [3]>([true, false, true])];
            tensor<fp16, [1, 129, 3]> var_343_cast_fp16 = slice_by_index(begin = var_343_begin_0, end = var_343_end_0, end_mask = var_343_end_mask_0, x = stft_out_3_cast_fp16)[name = tensor<string, []>("op_343_cast_fp16")];
            tensor<int32, [3]> var_346_begin_0 = const()[name = tensor<string, []>("op_346_begin_0"), val = tensor<int32, [3]>([0, 129, 0])];
            tensor<int32, [3]> var_346_end_0 = const()[name = tensor<string, []>("op_346_end_0"), val = tensor<int32, [3]>([1, 258, 3])];
            tensor<bool, [3]> var_346_end_mask_0 = const()[name = tensor<string, []>("op_346_end_mask_0"), val = tensor<bool, [3]>([true, true, true])];
            tensor<fp16, [1, 129, 3]> var_346_cast_fp16 = slice_by_index(begin = var_346_begin_0, end = var_346_end_0, end_mask = var_346_end_mask_0, x = stft_out_3_cast_fp16)[name = tensor<string, []>("op_346_cast_fp16")];
            tensor<fp16, []> var_325_promoted_to_fp16 = const()[name = tensor<string, []>("op_325_promoted_to_fp16"), val = tensor<fp16, []>(0x1p+1)];
            tensor<fp16, [1, 129, 3]> var_348_cast_fp16 = pow(x = var_343_cast_fp16, y = var_325_promoted_to_fp16)[name = tensor<string, []>("op_348_cast_fp16")];
            tensor<fp16, []> var_325_promoted_1_to_fp16 = const()[name = tensor<string, []>("op_325_promoted_1_to_fp16"), val = tensor<fp16, []>(0x1p+1)];
            tensor<fp16, [1, 129, 3]> var_349_cast_fp16 = pow(x = var_346_cast_fp16, y = var_325_promoted_1_to_fp16)[name = tensor<string, []>("op_349_cast_fp16")];
            tensor<fp16, [1, 129, 3]> var_350_cast_fp16 = add(x = var_348_cast_fp16, y = var_349_cast_fp16)[name = tensor<string, []>("op_350_cast_fp16")];
            tensor<fp16, []> var_351_to_fp16 = const()[name = tensor<string, []>("op_351_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [1, 129, 3]> var_352_cast_fp16 = add(x = var_350_cast_fp16, y = var_351_to_fp16)[name = tensor<string, []>("op_352_cast_fp16")];
            tensor<fp16, [1, 129, 3]> magnitude_3_cast_fp16 = sqrt(x = var_352_cast_fp16)[name = tensor<string, []>("magnitude_3_cast_fp16")];
            tensor<fp16, []> var_354_to_fp16 = const()[name = tensor<string, []>("op_354_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [1, 129, 3]> var_355_cast_fp16 = add(x = magnitude_3_cast_fp16, y = var_354_to_fp16)[name = tensor<string, []>("op_355_cast_fp16")];
            tensor<fp16, []> input_23_epsilon_0_to_fp16 = const()[name = tensor<string, []>("input_23_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 129, 3]> input_23_cast_fp16 = log(epsilon = input_23_epsilon_0_to_fp16, x = var_355_cast_fp16)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<string, []> input_25_pad_type_0 = const()[name = tensor<string, []>("input_25_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_25_pad_0 = const()[name = tensor<string, []>("input_25_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> input_25_strides_0 = const()[name = tensor<string, []>("input_25_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> input_25_dilations_0 = const()[name = tensor<string, []>("input_25_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_25_groups_0 = const()[name = tensor<string, []>("input_25_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 128, 3]> input_25_cast_fp16 = conv(bias = encoder_layers_0_bias_to_fp16, dilations = input_25_dilations_0, groups = input_25_groups_0, pad = input_25_pad_0, pad_type = input_25_pad_type_0, strides = input_25_strides_0, weight = encoder_layers_0_weight_to_fp16_quantized, x = input_23_cast_fp16)[name = tensor<string, []>("input_25_cast_fp16")];
            tensor<fp16, [1, 128, 3]> x_19_cast_fp16 = relu(x = input_25_cast_fp16)[name = tensor<string, []>("x_19_cast_fp16")];
            tensor<fp16, []> const_4_to_fp16 = const()[name = tensor<string, []>("const_4_to_fp16"), val = tensor<fp16, []>(-inf)];
            tensor<fp16, []> var_357_to_fp16 = const()[name = tensor<string, []>("op_357_to_fp16"), val = tensor<fp16, []>(0x1.388p+13)];
            tensor<fp16, [1, 128, 3]> clip_4_cast_fp16 = clip(alpha = const_4_to_fp16, beta = var_357_to_fp16, x = x_19_cast_fp16)[name = tensor<string, []>("clip_4_cast_fp16")];
            tensor<string, []> input_29_pad_type_0 = const()[name = tensor<string, []>("input_29_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_29_pad_0 = const()[name = tensor<string, []>("input_29_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> input_29_strides_0 = const()[name = tensor<string, []>("input_29_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> input_29_dilations_0 = const()[name = tensor<string, []>("input_29_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_29_groups_0 = const()[name = tensor<string, []>("input_29_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 3]> input_29_cast_fp16 = conv(bias = encoder_layers_2_bias_to_fp16, dilations = input_29_dilations_0, groups = input_29_groups_0, pad = input_29_pad_0, pad_type = input_29_pad_type_0, strides = input_29_strides_0, weight = encoder_layers_2_weight_to_fp16_quantized, x = clip_4_cast_fp16)[name = tensor<string, []>("input_29_cast_fp16")];
            tensor<fp16, [1, 64, 3]> x_21_cast_fp16 = relu(x = input_29_cast_fp16)[name = tensor<string, []>("x_21_cast_fp16")];
            tensor<fp16, []> const_5_to_fp16 = const()[name = tensor<string, []>("const_5_to_fp16"), val = tensor<fp16, []>(-inf)];
            tensor<fp16, [1, 64, 3]> clip_5_cast_fp16 = clip(alpha = const_5_to_fp16, beta = var_357_to_fp16, x = x_21_cast_fp16)[name = tensor<string, []>("clip_5_cast_fp16")];
            tensor<string, []> input_33_pad_type_0 = const()[name = tensor<string, []>("input_33_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_33_pad_0 = const()[name = tensor<string, []>("input_33_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> input_33_strides_0 = const()[name = tensor<string, []>("input_33_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> input_33_dilations_0 = const()[name = tensor<string, []>("input_33_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_33_groups_0 = const()[name = tensor<string, []>("input_33_groups_0"), val = tensor<int32, []>(1)];
